---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCExtrusionData.IsValid
source: html/d38f38f1-f3e8-3cb2-19d7-6b1086994156.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionData.IsValid Method

Determines if the extrusion data represents a valid extrusion.

## Syntax (C#)
```csharp
public bool IsValid()
```

## Returns
True if the extrusion is valid, false otherwise.